2021-12-07
[1단계:개념] 1. 웹프로그램에서 프런트단과 백앤드단을 나누는 기준은 무엇인가?
[1단계:개념] 2. 프런트단 html, css, javascript의 각각의 핵심 역할을 기술하세요
	html : html 문서 파일을 웹 브라우저가 해석을 해서 구조를 통해 화면에 렌더링 해주게되고
		사용자는 View라는 스크린을 통해 접하게 된다
	css :  html로 만들어진 문서의 텍스트 색상이나 크기, 이미지 크기나 위치, 표의 색상,
		배치방법 등 웹 문서의 디자인 요소를 담당한다.
	javascript : 웹브라우저 위에서 html 웹 페이지를 동적처리를 담당한다.
	
[1단계:개념] 3. 백앤드단 java와 database의 역할을 기술하세요.
	java: 백엔드단에서 필요로 하는 변수, 메모리설정, 객체처리, 조건/반복문 처리 등의 기능과
		내장된 객체를 이용해서 여러가지 프로그래밍적인 처리를 한다.
	database: 여러 사람이 공유하여 사용할 목적으로 데이터를 체계화해 통합, 관리한다.
	
[1단계:개념] 4. jsp 프로그램의 처리되는 과정을 기술하세요.
[2단계:확인] 5. javascript의 이벤트와 이벤트핸들러를 통해서, h1 클릭시마다 정렬이 연속적으로 변경되게 하세요.
[2단계:확인] 6. javascript의 이벤트와 이벤트핸들러를 통해서, h2 클릭시마다 배경 색상이 연속적으로 무지개색상으로 변경되게 하세요.
		
[1단계:개념] 7. jsp의 코드가 들어가는 부분과 출력이 처리되는 부분을 구분하여 처리하세요
[2단계:개념] 8. jsp에서 변수, 객체, 배열을 선언하여 화면에 출력하세요.